/*
 RootCollation.swift

 This source file is part of the SDGCornerstone open source project.
 https://sdggiesbrecht.github.io/SDGCornerstone

 Copyright ©2019 Jeremy David Giesbrecht and the SDGCornerstone project contributors.

 Soli Deo gloria.

 Licensed under the Apache Licence, Version 2.0.
 See http://www.apache.org/licenses/LICENSE-2.0 for licence information.
 */

import SDGCollation

extension CollationOrder {

  static func generateRoot() throws -> CollationOrder {
    print("Tailoring root collation...")
    let root = try ducet().tailored {

      "<_end_>" ←< "<and>" ←< "<alt>" ←< "<sub>"

      "̀" ←= "<̀‐it>"  // Original
      "́" ←= "<́‐el>"  // Original
      "̂" ←= "<̂‐pt>"  // Reset later
      "̌" ←= "<̌‐cs>"  // Original
      "̈" ←= "<̈‐el>"  // Original

      "<_ReverseAccent_>" ←<< "<́‐fr>" ←<< "<̀‐fr>" ←<< "<̂‐fr>" ←<< "<̈‐fr>"
        ←<< "̧" /* Original (fr) */
      "<̂‐fr>" ←= "̂"  // Original

      "<digraph>" <→ "<̌‐hr>" <→ "<́‐pl>" <→ "<̈‐hu>" <→ "̃" /* Original (es) */ <→ "<stroke>"
        <→ "<_final_>"

      /* a */"א" <<<<<<→ "α" <<<<<<→ "a"
      "Α" <<<<<<→ "A"

      /* b */"ב" <<<<<<→ "β" <<<<<<→ "b"
      "Β" <<<<<<→ "B"

      /* c */"ג" <<<<<<→ "γ" <<<<<<→ "c"
      "Γ" <<<<<<→ "C"
      "ᴦ" <<<<<<→ "ᴄ"

      /* d */"ד" <<<<<<→ "δ" <<<<<<→ "d"
      "Δ" <<<<<<→ "D"

      "D<stroke>" ←= "Đ"
      "d<stroke>" ←= "đ"

      /* e */"ה" <<<<<<→ "ε" <<<<<<→ "e"
      "e" ←<<<<<< "<̈‐de‐tel>"
      "Ε" <<<<<<→ "E"

      /* f */"ו" <<<<<<→ "ϝ" <<<<<<→ "ͷ" <<<<<<→ "ϛ" <<<<<<→ "f"
      "Ϝ" <<<<<<→ "Ͷ" <<<<<<→ "Ϛ" <<<<<<→ "F"

      /* g */"ז" <<<<<<→ "ζ" <<<<<<→ "g"
      "Ζ" <<<<<<→ "G"

      /* h */"ח" <<<<<<→ "η" <<<<<<→ "h"
      "Η" <<<<<<→ "H"

      "ͱ" <<<<<<→ "ⱶ"
      "Ͱ" <<<<<<→ "Ⱶ"

      /* θ */"ט" <<<<<<→ "θ" <→ "i"
      "θ" ←<<<< "Θ"

      /* i */"י" <<<<<<→ "ι" <<<<<<→ "i"
      "Ι" <<<<<<→ "I"

      "j" ←<<<<<< "ϳ"
      "J" ←<<<<<< "Ϳ"

      /* k */"כ" <<<<<<→ "ך" <<<<<<→ "κ" <<<<<<→ "k"
      "Κ" <<<<<<→ "K"

      /* l */"ל" <<<<<<→ "λ" <<<<<<→ "l"
      "Λ" <<<<<<→ "L"
      "ᴧ" <<<<<<→ "ʟ"

      /* m */"מ" <<<<<<→ "ם" <<<<<<→ "μ" <<<<<<→ "m"
      "Μ" <<<<<<→ "M"

      /* n */"נ" <<<<<<→ "ן" <<<<<<→ "ν" <<<<<<→ "n"
      "Ν" <<<<<<→ "N"

      /* ξ */"ס" <<<<<<→ "ξ" <→ "o"
      "ξ" ←<<<< "Ξ"

      /* o */"ע" <<<<<<→ "ο" <<<<<<→ "o"
      "Ο" <<<<<<→ "O"

      /* p */"פ" <<<<<<→ "ף" <<<<<<→ "π" <<<<<<→ "p"
      "Π" <<<<<<→ "P"
      "ᴨ" <<<<<<→ "ᴘ"

      /* ϻ */"צ" <<<<<<→ "ץ" <<<<<<→ "ϻ" <→ "q"
      "ϻ" ←<<<< "Ϻ"

      /* q */"ק" <<<<<<→ "ϙ" <<<<<<→ "ϟ" <<<<<<→ "q"
      "Ϙ" <<<<<<→ "Ϟ" <<<<<<→ "Q"

      /* r */"ר" <<<<<<→ "ρ" <<<<<<→ "ϼ" <<<<<<→ "r"
      "Ρ" <<<<<<→ "R"
      "ᴩ" <<<<<<→ "ʀ"

      /* s */"ש" <<<<<<→ "σ" <<<<<<→ "ς" <<<<<<→ "s"
      "Σ" <<<<<<→ "S"
      "σ" ←<<<<< "ͼ"
      "Σ" ←<<<<< "Ͼ"
      "ͼ" ←<<<<< "ͻ"
      "Ͼ" ←<<<<< "Ͻ"
      "ͻ" ←<<<<< "ͽ"
      "Ͻ" ←<<<<< "Ͽ"

      /* t */"ת" <<<<<<→ "τ" <<<<<<→ "t"
      "Τ" <<<<<<→ "T"

      "υ" <<<<<<→ "v"
      "Υ" <<<<<<→ "V"

      "φ" <→ "x"
      "φ" ←<<<< "Φ"

      "χ" <<<<<<→ "x"
      "Χ" <<<<<<→ "X"

      "ψ" <→ "ω" <→ "ꭥ" <→ "ͳ" <→ "ϸ" <→ "y"
      "ψ" ←<<<< "Ψ"
      "ψ" ←< "ᴪ"

      "ω" ←<<<< "Ω"

      "ͳ" ←<<<< "Ͳ"
      "ͳ" ←<<<<<< "ϡ"
      "Ͳ" ←<<<<<< "Ϡ"

      "ϸ" ←<<<< "Ϸ"

      /* ff */"װ" ←<<<<<< "וו"
      /* fi */"ױ" ←<<<<<< "וי"
      /* ii */"ײ" ←<<<<<< "יי"

      "και" ←<<<<<< "ϗ"
      "Και" ←<<<<<< "Ϗ"
    }
    print("Finished tailoring root collation.")
    return root
  }
}
